uat_chat/AccumulationRegisters/уатЗаказыГрузоотправителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаказыГрузоотправителей</Name>
			<Comment>(уэ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество, всегда 1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Comment>Только родительский грузы (не этапы)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатЗаказыГрузоотправителей/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
// 
Процедура ВыполнитьПриход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;

	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = текСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	Записать();
	
КонецПроцедуры

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;
	
	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = ТекСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	// запись движений
	Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	#Если Клиент Тогда
		Оповестить("Изменен заказ грузоотправителя");
	#КонецЕсли
КонецПроцедуры
